app/Controllers/Carrito_controller.php

SELECT *
FROM `productos`
WHERE `id_producto` = '17'
 LIMIT 1
---
    public function sumar_carrito($id = null){
        $cart = \Config\Services::cart();

        $producto = new Producto_model();
        $id_producto = $cart->getItem($id)["id"];
        $producto = $producto->where('id_producto', $id_producto)->first();

SELECT *
FROM `productos`
WHERE `id_producto` = '13'
 LIMIT 1
---
    public function restar_carrito($id = null){
        $cart = \Config\Services::cart();

        $producto = new Producto_model();
        $id_producto = $cart->getItem($id)["id"];
        $producto = $producto->where('id_producto', $id_producto)->first();