app/Controllers/CategoriasController.php

SELECT *
FROM `categorias`
ORDER BY `id_categoria` DESC
---
    public function index()
    {

        $categoriaModel = new Categoria_model();
        $data['categorias'] = $categoriaModel->orderBy('id_categoria', 'DESC')->findAll();

SELECT *
FROM `categorias`
ORDER BY `id_categoria` DESC
---
    public function vista_categoria_eliminados() {
        $categoriaModel = new Categoria_model();
        $data['categorias'] = $categoriaModel->orderBy('id_categoria', 'DESC')->findAll();