app/Controllers/Consulta_controller.php

  public function ver_consultas_respondidas($id = null)
  {

    $data['titulo'] = 'Consultas respondidas';
    $v_consulta_model = new Consulta_model();
    $data['consultas'] = $v_consulta_model->orderBy('id_consulta')->findAll();
---
SELECT *
FROM `consultas`
ORDER BY `id_consulta`