app/Controllers/ProductoController.php

                ];
            }

            $producto->update($id, $data);
---
UPDATE `productos` SET `descripcion_prod` = 'Gaseosa Coca Cola sabor original 2.25 l.', `cod_categoria` = '2', `precio` = '750', `precio_venta` = '950', `stock` = '11111', `stock_min` = '1'
WHERE `productos`.`id` IN ('9')