app/Controllers/ProductoController.php

    public function index()
    {
        $productoModel = new Producto_model();

        $data['productos'] = $productoModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id` DESC

    public function crearproducto() {
        $productoModel = new Producto_model();
        $lista_productos['obj'] = $productoModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id` DESC

    public function editarproducto($id = null) {

        $productoModel = new Producto_model();

        $data['titulo'] = 'Editar producto';

        //$id= $this->request->getPostGet('id');
        //$data['producto'] = $productoModel->where('id', $id)->first();
        $data['old'] = $productoModel->where('id', $id)->first();
---
SELECT *
FROM `productos`
WHERE `id` = '8'
 LIMIT 1