app/Controllers/ProductoController.php

SELECT *
FROM `productos`
ORDER BY `id_producto` DESC
SELECT *
FROM `categorias`
ORDER BY `id_categoria` DESC
---
    public function index()
    {
        $productoModel = new Producto_model();

        $data['productos'] = $productoModel->orderBy('id_producto', 'DESC')->findAll();
        $categoriaModel = new Categoria_model();
        $data['categorias'] = $categoriaModel->orderBy('id_categoria', 'DESC')->findAll();

SELECT *
FROM `productos`
ORDER BY `id_producto` DESC
---
    public function crearproducto() {
        $productoModel = new Producto_model();
        $data['obj'] = $productoModel->orderBy('id_producto', 'DESC')->findAll();

SELECT *
FROM `categorias`
ORDER BY `id_categoria` DESC
SELECT *
FROM `productos`
WHERE `id_producto` = '17'
 LIMIT 1
SELECT *
FROM `categorias`
WHERE `id_categoria` = '1'
 LIMIT 1
---
    public function vistaEditarProducto($id = null) {

        $productoModel = new Producto_model();

        $data['titulo'] = 'Editar producto';
        $categoriaModel = new Categoria_model();

        $data['categorias'] = $categoriaModel->orderBy('id_categoria', 'DESC')->findAll();
        //$id= $this->request->getPostGet('id');
        //$data['producto'] = $productoModel->where('id', $id)->first();
        $data['old'] = $productoModel->where('id_producto', $id)->first();
        //dd($data['old']['cod_categoria']);
        $data['categoria_producto'] = $categoriaModel->where('id_categoria', $data['old']['cod_categoria'])->first();

UPDATE `productos` SET `descripcion_prod` = 'Palitos de maíz super queso Cheetos 238 g.', `cod_categoria` = '1', `precio` = '1450.99', `precio_venta` = '2460.99', `stock` = '10', `stock_min` = '1'
WHERE `productos`.`id_producto` IN ('17')
---
                    //'eliminado' => NO
                ];

                $producto->update($id, $data);