app/Controllers/Usuario_controller.php

SELECT *
FROM `usuarios`
SELECT *
FROM `perfiles`
---
  public function cargar_crud($id = null)
  {

    $data['titulo'] = 'CRUD Usuarios';
    $v_usuarios_model = new Usuarios_model();
    $data['usuarios'] = $v_usuarios_model->findAll();

    $v_perfiles_model = new Perfiles_model();
    $data['perfiles'] = $v_perfiles_model->findAll();

SELECT *
FROM `usuarios`
SELECT *
FROM `perfiles`
---
  public function ver_eliminados($id = null)
  {

    $data['titulo'] = 'Usuarios eliminados';
    $v_usuarios_model = new Usuarios_model();
    $data['usuarios'] = $v_usuarios_model->findAll();

    $v_perfiles_model = new Perfiles_model();
    $data['perfiles'] = $v_perfiles_model->findAll();

SELECT *
FROM `usuarios`
WHERE `id_usuario` = '13'
 LIMIT 1
SELECT *
FROM `perfiles`
---
  public function ver_editarUsuario($id = null)
  {
    $data['titulo'] = 'Editar Usuario';
    $v_usuarios_model = new Usuarios_model();
    $data['usuario'] = $v_usuarios_model->where('id_usuario', $id)->first();

    $v_perfiles_model = new Perfiles_model();
    $data['perfiles'] = $v_perfiles_model->findAll();